-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Час створення: Лип 10 2019 р., 20:17
-- Версія сервера: 8.0.16
-- Версія PHP: 7.1.18

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `leaf`
--

-- --------------------------------------------------------

--
-- Структура таблиці `points`
--

CREATE TABLE `points` (
  `id` int(11) UNSIGNED NOT NULL,
  `datetime` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `lat` decimal(10,8) NOT NULL,
  `lng` decimal(11,8) NOT NULL,
  `message` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп даних таблиці `points`
--

INSERT INTO `points` (`id`, `lat`, `lng`, `message`) VALUES
(1, '60.04058900', '31.29273800', '744'),
(2, '60.04803600', '31.42860700', '731'),
(3, '60.05981500', '31.44159800', '152'),
(4, '60.06758800', '31.26719000', '905'),
(5, '60.08943400', '31.25684600', '645'),
(6, '60.09003500', '31.40613500', '311'),
(7, '60.12321300', '31.48185400', '768'),
(8, '60.17191800', '31.44337000', '140'),
(9, '60.14218200', '31.35512400', '168'),
(10, '60.16799000', '31.25076600', '903'),
(11, '60.17796800', '31.39362000', '195'),
(12, '60.17754600', '31.53116100', '990'),
(13, '60.20775000', '31.57892700', '90'),
(14, '60.19894400', '31.45866300', '108'),
(15, '60.22210700', '31.28567200', '978'),
(16, '60.23821200', '31.40946800', '253'),
(19, '60.01392200', '31.29273800', '48'),
(22, '60.07092100', '31.26052300', '60'),
(23, '60.09943400', '31.24017900', '726'),
(24, '60.12670200', '31.41280200', '847'),
(25, '60.11654600', '31.44852000', '674'),
(26, '60.15525200', '31.49003700', '914'),
(27, '60.18551600', '31.37845700', '229'),
(28, '60.17799000', '31.29743300', '982'),
(29, '60.17796800', '31.35362000', '208'),
(30, '60.18754600', '31.57449400', '127'),
(31, '60.23108300', '31.55559300', '20'),
(32, '60.21561000', '31.46866300', '466'),
(33, '60.24210700', '31.27567200', '727'),
(34, '60.24821200', '31.40280200', '407'),
(35, '60.23396300', '31.59795200', '444'),
(36, '60.30038500', '31.22383100', '854');

-- --------------------------------------------------------

--
-- Структура таблиці `polyline`
--

CREATE TABLE `polyline` (
  `id` int(11) UNSIGNED NOT NULL,
  `lat` decimal(10,8) NOT NULL,
  `lng` decimal(11,8) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп даних таблиці `polyline`
--

INSERT INTO `polyline` (`id`, `lat`, `lng`) VALUES
(1, '60.04058900', '31.28940500'),
(2, '60.04470300', '31.44527400'),
(3, '60.07314800', '31.44493100'),
(4, '60.07092100', '31.27052300'),
(5, '60.10276700', '31.27017900'),
(6, '60.10670200', '31.40613500'),
(7, '60.13321300', '31.46518700'),
(8, '60.16858500', '31.46003700'),
(9, '60.15884900', '31.34845700'),
(10, '60.16465700', '31.26743300'),
(11, '60.18463500', '31.37695300'),
(12, '60.18087900', '31.54449400'),
(13, '60.21108300', '31.58226000'),
(14, '60.21227700', '31.45866300'),
(15, '60.21210700', '31.27567200'),
(16, '60.23154500', '31.40613500'),
(17, '60.25063000', '31.59461900'),
(18, '60.29038500', '31.22383100');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `points`
--
ALTER TABLE `points`
  ADD PRIMARY KEY (`id`);

--
-- Індекси таблиці `polyline`
--
ALTER TABLE `polyline`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `points`
--
ALTER TABLE `points`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;

--
-- AUTO_INCREMENT для таблиці `polyline`
--
ALTER TABLE `polyline`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
